export const articles = Array.from({ length: 30 }, (_, i) => ({
  id: `${i + 1}`,
  title: `뉴스 기사 ${i + 1}`,
  summary: `이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.이것은 뉴스 기사 ${i + 1}의 요약입니다.`,
  imageUrl: "/images/newThums.png",
  publishedAt: "2025-04-20",
}));
